# HW2_python
# 14. Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.
# Пример:
# 6782 -> 23
# 0,56 -> 11

numb = input("Введите число: ")
summa = 0
for i in numb:
    if i != '.':
        summa = summa + int(i)
print(f'сумма цифр числа {numb} = {summa}')


# 15. Напишите программу, которая принимает на вход число N и выдает набор произведений
# чисел от 1 до N.
# Пример:
# - пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)

numb = int(input("Введите число: "))
x = 1
for i in range(1, numb + 1):
    print(i * x, end=' ')
    x = i * x
    
    
# 16 Задайте список из n чисел последовательности (1+1/n)^n и выведите на экран их сумму.
# Пример:
# Для n = 6: {1: 2, 2: 2,25, 3: 2,37, 4: 2,44, 5: 2,49, 6: 2,52}

n=int(input("Введите n: "))
my_dict={}
for i in range(1,n+1):
    my_dict[i] = round((1+1/i)**i,2)
print(my_dict)


# 17. Задайте список из N элементов, заполненных числами из промежутка [-N, N].
# Найдите произведение элементов на введенных пользователем позициях.

n = int(input("Введите число N: "))
el1=int(input("Введите позицию элемента 1 для умножения: "))
el2=int(input("Введите позицию элемента 2 для умножения: "))
my_list=[]
for i in range(-n,n+1):
    my_list.append(i)
print("Последовательность элементов: ", my_list)
print(f'Произведение элементов {el1} и {el2}: {my_list[el1]} * {my_list[el2]} = {my_list[el1]*my_list[el2]}')



# 18. Реализуйте алгоритм перемешивания списка.

import random
my_list=["первый","второй","третий","четвертый","пятый"]
random.shuffle(my_list)
print(my_list)

